Revit 2027 API
TableSectionData.IsValidRowNumber Method
 Verifies if the row number is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidRowNumber(
	int nRow
)
Public Function IsValidRowNumber (
	nRow As Integer
) As Boolean
public:
bool IsValidRowNumber(
	int nRow
)
member IsValidRowNumber :
        nRow : int -> bool
Parameters
nRow Int32
 The row number.
Return Value
Boolean
 True if the row number is between FirstRowNumber and LastRowNumber, false otherwise.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace